/*Date:25-12-2021 | Time~7:39 PM

★2D Array★
arr[row][col]={ {}, {}, {} }

arra[3][4]={
	
	  {1,2,3,4},
	  {5,6,7,8},
	  {9,10,11,12}
	  
	};
	
এই অ্যারেটার 3 টা রো ও 4 টি কলাম রয়েছে।
সেজন্য আগেই রো ও কলামের সাইজ [3][4] 
ঠিক করে দিয়েছি।

3 টা রো ও 4 টা কলামের অ্যারের টোটাল 
ইলিমেন্ট row*col বা 3*4=12 টি।

যদি অ্যারেটার প্রথম রো এর প্রথম ইলিমেন্ট 
শো করতে চাই তাহলে arra[0][0] মানে প্রথম রো ও প্রথম কলাম।

যদি অ্যারেটার প্রথম রো এর  2য়  ইলিমেন্ট শো করতে চাই,
তাহলে arra[0][1] মানে প্রথম রো ও   
দ্বিতীয় কলাম
 
আবার,
যদি অ্যারেটার দ্বিতীয় রো এর ১ম ইলিমেন্ট শো করতে চাই,
তাহলে arra[1][0] মানে দ্বিতীয় রো ও প্রথম কলাম

*/

#include<stdio.h>
int main()
{
//2D Array যার 3 টি রো ও 4 টি কলাম আছে।
int arr[3][4]={
	
	    {10,11,12,13},
	    {14,15,16,17},
	    {18,19,20,21}
	    
	};

printf("2D Array Print\n\n");
for(int i=0;i<3;i++){//row
   for(int j=0;j<4;j++){//col
      printf("%d ",arr[i][j]);//arr[row][col]
   }
/*
row=0 এর ক্ষেত্রেঃ-
col বা j চলবে 4 এর আগ পর্যন্ত তারপর নতুন লাইন হবে।
arr[0][0] arr[0][1] arr[0][2] arr[0][3]
10 11 12 13
প্রিন্ট হবে এরপর printf("\n"); বা নিউ লাইন।


row=1 এর ক্ষেত্রেঃ-
col বা j চলবে 4 এর আগ পর্যন্ত তারপর নতুন লাইন হবে।
arr[1][0] arr[1][1] arr[1][2] arr[1][3]
14 15 16 17
প্রিন্ট হবে এরপর printf("\n"); বা নিউ লাইন।


row=2 এর ক্ষেত্রেঃ-
col বা j চলবে 4 এর আগ পর্যন্ত তারপর নতুন লাইন হবে।
arr[2][0] arr[2][1] arr[2][2] arr[2][3]
18 19 20 21
প্রিন্ট হবে এরপর printf("\n"); বা নিউ লাইন।
*/
   printf("\n");
}






}





