/*Date:3-12-2021 | Time~6:49 PM



***       ***round()***        ***

round() ফাংশনটার কাজ হলো দশমিকের পরে 
0.1 থেকে  0.4 পর্যন্ত থাকলে দশমিকের ডানের 
সব বাদ দিয়ে দিবে,শুধু বাম পাশের পূর্ণমানটা রাখবে।
তবে 0.5 থাকলে দশমিকের বাম পাশে এক বাড়িয়ে
দিবে।যেমন round(7.4354) এটার রেজাল্ট আসবে
7.00 কারণ দশমিকের পরে 0.4 পর্যন্ত আছে।
যদি round(7.534) এরকম থাকত তাহলে রেজাল্ট আসত
8.00 মানে দশমিকের বামে এক বাড়িয়ে 7 কে 8
করে দিয়েছে। কারণ দশমিকের পরে 0.5 আছে।







**       ***trunc()***       **

trunc() দশমিকের পরের সবকিছু বাদ দিয়ে দিবে শুধু 
পূর্ণসংখ্যাটা রাখবে।যেমন trunc(3.8665) 
থাকলে রেজাল্ট আসবে শুধু 3.00






***        ***ceil()***        ***

ceil() বলতে উপরে বুঝায় মানে দশমিকের পর
যদি 2.1 থাকে তাহলে এটাকে উপরের পূর্ণ সংখ্যায়
রূপান্তর করবে, মানে 2.1 এর উপরের পূর্ণ সংখ্যা 
হলো 3.00
আবার যদি -2.1 থাকত তাহলে এটার রেজাল্ট হতো
-2, কারণ -2.1 থেকে -2 উপরে বা বড়।




***        ***floor()***        ***
floor() বলতে নিচে বুঝায় মানে দশমিকের পর
যদি 2.1 থাকে তাহলে এটাকে নিচের পূর্ণ সংখ্যায়
রূপান্তর করবে, মানে 2.1 এর নিচের পূর্ণ সংখ্যা 
হলো 2.00
আবার যদি -2.1 থাকত তাহলে এটার রেজাল্ট হতো
-3.00, কারণ -2.1 থেকে -3 নিচে বা ছোট।








*/

#include<stdio.h>
#include<math.h>
int main()
{

double x,result;
printf("Enter Any Float Number:");
scanf("%lf",&x);

result=round(x);
printf("round(%lf) is:%.2lf",x,result);

result=trunc(x);
printf("\ntrunc(%lf) is:%.2lf",x,result);

result=ceil(x);
printf("\nceil(%lf) is:%.2lf",x,result);

result=floor(x);
printf("\nfloor(%lf) is:%.2lf",x,result);


}


