/*Date:6-12-2021 | Time~11:08 PM

Leap Year নির্ণয়ের প্রোগ্রাম!

প্রথম কন্ডিশনে বছরকে 400 দ্বারা ভাগ
করলে যদি ভাগশেষ না থাকে তাহলে সেটা 
লিপ ইয়ার।যেমন ২০০০ কে ৪০০ দ্বারা ভাগ 
করলে ভাগশেষ থাকে না তাই ২০০০ সাল লিপ ইয়ার।

কিন্তু ২০১৬ সালও তো লিপ ইয়ার তাহলে এই 
নিয়মে হচ্ছে না, তাই পরের কন্ডিশনে 
ইয়ারকে 4 দ্বারা ভাগ করলে ভাগশেষ না
পাওয়া গেলে এবং উক্ত ইয়ারকে 100 দ্বারা ভাগ 
করলে ভাগশেষ পাওয়া গেলে সেটা লিপ ইয়ার। 

পরের কন্ডিশনে মনে হতে পারে শুধু 4 দ্বারা 
ভাগ করলেই তো হতো তাহলে আবার 100 দ্বারা চেক
করার কি দরকার ছিল????
এর কারণ হলো ১০০০ সালকে  শুধু 4 দ্বারা ভাগ 
করলে এর ভাগশেষ থাকে না, মানে এটা লিপ ইয়ার
শো করবে!অথচ ১০০০ সাল লিপ ইয়ার না। তাই 4 দ্বারা
চেক এর পাশাপাশি 100 দ্বারাও চেক করা হয়েছে।
*/

#include<stdio.h>
int main()
{
int y;
printf("Enter Any Year:");
scanf("%d",&y);

  if(y%400==0){
    printf("Leap Year");
  }
  else if(y%4==0 && y%100!=0){
    printf("Leap Year");
  }
  else{
    printf("Not Leap Year");
  }



}

