/*Date:9-12-2021 | Time~7:56 P
Prime Number বের করার প্রোগ্রাম

Prime Number হলো ঐসব নাম্বার যাদের 1 ও 
উক্ত সংখ্যা ছাড়া ভাগ করা যায় না।
যেমন 5 কে 1 ও 5 ছাড়া আর কোন সংখ্যা দিয়ে
ভাগ করা যায় না তাই 5 একটি মৌলিক সংখ্যা।


তাহলে কোন সংখ্যা মৌলিক কিনা সেটা
বের করতে গেলে আমরা একটা লুপ চালাবো 
উক্ত সংখ্যার আগ পর্যন্ত এবং উক্ত সংখ্যাকে
লুপের i এর ভেলু দ্বারা ভাগ করে দেখব উক্ত
সংখ্যাটা নিঃশেষে বিভাজ্য হয় কিনা?
যদি না হয় তাহলে প্রাইম বা মৌলিক 
নাম্বার আর নিঃশেষে বিভাজ্য হলে মৌলিক
নাম্বার না। 
*/


#include<stdio.h>
int main()
{
int num,count=0;
printf("Enter Any Positive Number:");
scanf("%d",&num);

  for(int i=2;i<num;i++){
    if(num%i==0){
     count++;
     break;
    }
    /* i এর ভেলু দ্বারা উক্ত নাম্বারটিকে 
    ভাগ করে দেখেছি এটা নিঃশেষে বিভাজ্য 
    কিনা?নিঃশেষে বিভাজ্য হলে count++
    করে দিব আর লুপটা ব্রেক করে দিব। 
    */
  }
  
  
  if(count==0 && num!=1){
  	printf("%d is a Prime Number",num);
  	/*যদি নিঃশেষে বিভাজ্য না হয় তাহলে কখনো
  	count++ হবে না, মানে count=0 ই থাকবে।
      এর মানে হলো এটা প্রাইম নাম্বার।
  	*/
  }
  else{
      printf("%d is not a Prime Number",num);
  }


}



