/*Date:13-12-2021 | Time~10:21 AM

Series-3

1-2+3-4+5-6....n

এই সিরিজ থেকে দেখা যাচ্ছে বিজোড় 
সংখ্যাগুলোর আগে + চিহ্ন আর জোড়
সংখ্যাগুলোর আগে - চিহ্ন 

আমরা যদি n পর্যন্ত এই সিরিজের যোগফল 
বের করতে চাই তাহলে মাইনাস আর প্লাসের
গুলো আলাদা করে যোগ করতে হবে।

বিজোড়গুলোঃ(1+3+5+...)
জোড়গুলোঃ -(2+4+6+...)

তারপর বিজোড়গুলোর টোটাল যোগফল 
থেকে জোড়গুলোর টোটাল যোগফল বিয়োগ
করলেই ফল বের হবে৷ 
*/

#include<stdio.h>
int main()
{
int n,totalSum,even=0,odd=0;
printf("Enter Last Number of the Series:");
scanf("%d",&n);

for(int i=1;i<=n;i++){
  if(i%2==0){//জোড়গুলোর যোগফল
    even+=i;
  }
  else{//বিজোড়গুলোর যোগফল
    odd+=i;
  }
}

totalSum=odd-even;
//বিজোড়গুলোর টোটাল যোগফল থেকে জোড়গুলোর টোটাল যোগফল বিয়োগ করে দিলাম


printf("Series Sum= %d",totalSum);
}







