/*Date:20-11-2021*/



#include<stdio.h>
/*
   C program এর বডিতে বিভিন্ন লাইব্রেরি ফাংশন থাকে যেমন printf() 
   
   এসব লাইব্রেরি ফাংশনগুলো stdio.h নামক হেডার ফাইলে থাকে। 
   তাই উপরে <stdio.h> দেওয়া হয়েছে।
   আর হেডার ফাইলগুলো সবসময় include করতে হয়।তাই <stdio.h> এর আগে #include দেওয়া হয়েছে।  
*/





int main()
{
	
	
	printf("Anik");
	/*
	  printf() নামক লাইব্রেরি ফাংশন কোন কিছু প্রিন্ট করতে ব্যবহার করা হয়ে থাকে।
	*/
	
	
	return 0;
	/*
	  এর মাধ্যমে বুঝাচ্ছি আমাদের প্রোগ্রামটা সাক্সেসফুলি এক্সিকিউট হয়েছে।
	*/
	
	
	
	}